app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    render locals: {
              articles:  Article.all

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "blah"], ["body", "blah blah blah"], ["created_at", "2018-03-23 04:17:28.967192"], ["updated_at", "2018-03-23 04:17:28.967192"]]
---
  def create
    @article = Article.new(article_params)
    @article.save

UPDATE "articles" SET "title" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["title", "REALLY REALLY great article"], ["updated_at", "2018-03-24 02:45:26.888512"], ["id", 2]]
---
  def update
    @article.update(article_params)